n = int(input())   #ряд выглядит так 0123456789    1 0    1  1     1   2 ... (до 10 р-число из ряда)
              # n=номера в этом ряду 12345678910  11 12   13 14    15 16....
              # двузначн чисел (10-99) 90 чисел по 2 цифры

p = n - 1

if p == 0:
    print(0)
elif p <= 9:
    print(p)
elif p <= 189:                    # двузначные числа 10-99 (9 + 180 = 189 цифр)
    p = p - 9                     # номер цифры внутри двузначных
    number = 10 + (p - 1) // 2    # само число, деление на 2 показывает, солько чисел мы уже пропустили
    pos = (p - 1) % 2             # ост = 0 - первая цифра числа, 1 - вторая
    if pos == 0:
        print(number // 10)       # десятки
    else:
        print(number % 10)        # единицы
else:                             # трёхзначные числа 100-200
    p = p - 189                   # номер цифры внутри трёхзначных
    number = 100 + (p - 1) // 3
    pos = (p - 1) % 3             # 0, 1 или 2
    if pos == 0:
        print(number // 100)      # сотни
    elif pos == 1:
        print(number // 10 % 10)  # десятки
    else:
        print(number % 10)        # единицы